In [2]:
import pandas as pd

Introduction to Pandas DataFrame and it's creation

In [3]:
data = {"Name":["Anurag","Arinjai","Arjav","Abufroo"],
        "Age":[17,19,18,20],
        "State":["Rajasthan","MP","UK","Manipur"]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

      Name  Age      State
0   Anurag   17  Rajasthan
1  Arinjai   19         MP
2    Arjav   18         UK
3  Abufroo   20    Manipur

Accessing any row or column of a DataFrame

In [6]:
df["Name"]

0     Anurag
1    Arinjai
2      Arjav
3    Abufroo
Name: Name, dtype: object

In [7]:
df.iloc[2]

Name     Arjav
Age         18
State       UK
Name: 2, dtype: object

Accessing multiple rows and columns of a DataFrame

In [8]:
df[["Name","State"]]

      Name      State
0   Anurag  Rajasthan
1  Arinjai         MP
2    Arjav         UK
3  Abufroo    Manipur

In [9]:
df.iloc[[1,3]]

      Name  Age    State
1  Arinjai   19       MP
3  Abufroo   20  Manipur

Other ways in which Pandas DataFrame can be created

In [10]:
df_another = pd.DataFrame(data=[["Anurag","Rajasthan",17],["Arinjai","MP",19],["Abufroo","Manipur",20]],columns = ["Name","State","Age"])

In [11]:
df_another

      Name      State  Age
0   Anurag  Rajasthan   17
1  Arinjai         MP   19
2  Abufroo    Manipur   20

In [12]:
import numpy as np

In [13]:
data = np.array([["Anurag","Rajasthan",17],["Arinjai","MP",19],["Abufroo","Manipur",20]])

In [14]:
data

array([['Anurag', 'Rajasthan', '17'],
       ['Arinjai', 'MP', '19'],
       ['Abufroo', 'Manipur', '20']], dtype='<U21')

In [15]:
df_another = pd.DataFrame(data,columns=["Name","State","Age"])

In [16]:
df_another

      Name      State Age
0   Anurag  Rajasthan  17
1  Arinjai         MP  19
2  Abufroo    Manipur  20

Adding a new column in a Pandas DataFrame

In [17]:
df_another["Specialization"] = ["AI","DS","NLP"]

In [18]:
df_another

      Name      State Age Specialization
0   Anurag  Rajasthan  17             AI
1  Arinjai         MP  19             DS
2  Abufroo    Manipur  20            NLP

Accessing Rows as well as columns simultaneously using iloc

In [19]:
df.iloc[[0,3],[0,2]]

      Name      State
0   Anurag  Rajasthan
3  Abufroo    Manipur

In [20]:
df.iloc[1:3,0:2]

      Name  Age
1  Arinjai   19
2    Arjav   18

In [21]:
df.iloc[1:4,[0,2]]

      Name    State
1  Arinjai       MP
2    Arjav       UK
3  Abufroo  Manipur

In [22]:
df

      Name  Age      State
0   Anurag   17  Rajasthan
1  Arinjai   19         MP
2    Arjav   18         UK
3  Abufroo   20    Manipur

In [23]:
df_another

      Name      State Age Specialization
0   Anurag  Rajasthan  17             AI
1  Arinjai         MP  19             DS
2  Abufroo    Manipur  20            NLP

In [24]:
df_another["Experience"] = ["3 Years","2 Years","5 Years"]

In [25]:
df_another

      Name      State Age Specialization Experience
0   Anurag  Rajasthan  17             AI    3 Years
1  Arinjai         MP  19             DS    2 Years
2  Abufroo    Manipur  20            NLP    5 Years

In [26]:
df_another.iloc[0:2,2:4]

  Age Specialization
0  17             AI
1  19             DS

In [27]:
df_another.iloc[0:3,0:3]

      Name      State Age
0   Anurag  Rajasthan  17
1  Arinjai         MP  19
2  Abufroo    Manipur  20

In [30]:
df_another

      Name      State Age Specialization Experience
0   Anurag  Rajasthan  17             AI    3 Years
1  Arinjai         MP  19             DS    2 Years
2  Abufroo    Manipur  20            NLP    5 Years

In [31]:
df_another["Cast"] = ["OBC","General","General"]

In [32]:
df_another

      Name      State Age Specialization Experience     Cast
0   Anurag  Rajasthan  17             AI    3 Years      OBC
1  Arinjai         MP  19             DS    2 Years  General
2  Abufroo    Manipur  20            NLP    5 Years  General

In [33]:
df_another.iloc[0:3,[2,4]]

  Age Experience
0  17    3 Years
1  19    2 Years
2  20    5 Years